Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 256, 256, 64)      640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 256, 256, 64)      36928     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 128, 128, 64)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 128, 128)     73856     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 128, 128, 128)     147584    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 128, 128, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 64, 64, 256)       295168    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 256)       590080    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 256)       590080    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 32, 32, 256)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 32, 32, 512)       1180160   
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 32, 512)       2359808   
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 32, 512)       2359808   
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 32, 32, 256)       1179904   
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 32, 32, 128)       295040    
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 64, 64, 128)       0         
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 64, 64, 64)        73792     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 64, 64, 32)        18464     
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 128, 128, 32)      0         
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 128, 128, 16)      4624      
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 128, 128, 2)       290       
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 256, 256, 2)       0         
=================================================================
Total params: 9,353,810
Trainable params: 9,353,810
Non-trainable params: 0
________________________________________________________________
